IdeaRS.OpenModel.Material.MaterialBoltGrade
Material bolt grade

IdeaRS.OpenModel.Material.MaterialBoltGrade.fub
Ultimate tensile strength

IdeaRS.OpenModel.Material.MaterialBoltGrade.fyb
Yield strength

IdeaRS.OpenModel.Material.MaterialBoltGrade.Elongation
Elongation after fracture - for 20% elongation use value 0.2

IdeaRS.OpenModel.Material.MaterialBoltGrade.Code
Design code

IdeaRS.OpenModel.Material.MaterialBoltGrade.MprlElementID
Name fo the bolt grade in MPRL database

IdeaRS.OpenModel.Material.MaterialBoltGrade.MprlTableID
Unique ID of MPRL database table where the bolt grade was taken from.